[
    {
        "title": "12 ways to improve turn-based RPG combat systems",
        "url": "https://sinisterdesign.net/12-ways-to-improve-turn-based-rpg-combat-systems/",
        "tags": [ "JRPG", "battle", "tactics" ],
        "blurb": "A list of twelve ways to change-up your RPG combat system, including using area, multiple characters, options, facing, and specialized monsters and characters. Focuses on emergent complexity, clarity, determinism, and tactics."
    },
    {
        "title": "How to make a modern game that feels like a classic JRPG",
        "url": "https://gamecrate.com/how-make-modern-game-feels-classic-jrpg/14295",
        "tags": [ "JRPG", "battle" ],
        "blurb": "A look at what made classic 16-bit JRPGs so great, and how to implement those in your own RPG: stories are the key, Combat should be puzzle-like, battles should be breakable, side-quests should be clear and compelling. Unique stories is not a requirement."
    },
    {
        "title": "Why are character-classes used in game design?",
        "url": "https://gamedev.stackexchange.com/questions/83251/why-are-character-classes-used-in-game-design",
        "tags": [ "RPG", "JRPG", "roguelike", "MOBA", "balance", "classes" ],
        "blurb": "Benefits of adding classes instead of using a class-less system in your game. They make it easier to balance, they help new players, they can provide class-specific quests or story plot points, and more."
    },
    {
        "title": "How to Start Designing Games",
        "url": "https://medium.com/super-jump/how-to-start-designing-games-f4cb5440ebf9",
        "tags": [ "theory", "mechanics", "prototyping", "aesthetics", "core loop", "goals" ],
        "blurb": "A thorough introduction to the fundamentals of game design, and how to implement them in your game. Aesthetics, mechanics, economy, narrative story, mechanics, goals, prototypes, and how to connect them all together."
    },
    {
        "title": "How To Perfect Your Game’s Core Loop",
        "url": "https://gameanalytics.com/blog/how-to-perfect-your-games-core-loop/",
        "tags": [ "core loop", "goals" ,"polish" ],
        "blurb": "How to design the core game loop and surrounding game loops to focus on the fun in your game. A clear goal, short loop, and strong theme go a long way. Prototype, iterate, and keep improving."
    },
    {
        "title": "The 13 Basic Principles of Gameplay Design",
        "url": "https://www.gamasutra.com/view/feature/132341/the_13_basic_principles_of_.php",
        "tags": [ "theory" ],
        "blurb": "13 fundamental principles of game design, with system, level, and UI design examples. Player role, communication, appeal, spacing, pacing, sound, physics, overlapping events, anticipation, believable behaviour, and more."
    },
    {
        "title": "How to Make an RPG: Levels",
        "url": "http://howtomakeanrpg.com/a/how-to-make-an-rpg-levels.html",
        "tags": [ "JRPG", "RPG", "project management", "formulas" ],
        "blurb": "Levels in RPGs instil a sense of achievement, dripfeed mechanics to the player, and control content flow. Analyzes formulas from Dungeons and Dragons, Pokemon, Disgea, and provides tips on writing your own formulas."
    },
    {
        "title": "Getting Started in Automated Game Design",
        "url": "https://www.youtube.com/watch?v=dZv-vRrnHDA",
        "tags": [ "procedural generation", "automated game design" ],
        "blurb": "A detailed introduction to automated game design: writing code that designs game mechanics for you. Start with three landmark games, look at the search space size, and use automated game-playing to tell how strategic or fun the game is.",
        "icon": "video"
    },
    {
        "title": "Are Lives Outdated Game Design?",
        "url": "https://www.youtube.com/watch?v=c2CLO8CcBjg",
        "tags": ["lives", "checkpoints", "side-scroller", "platformer"],
        "blurb": "Older games use lives or checkpoints, which cause frustration when replaying the same content over and over, but it's useful for procedural games. Powering up after death can reduce boredom. What other methods can replace lives?",
        "icon": "video"
    },
    {
        "title": "7 Game Design Mistakes to Avoid",
        "url": "https://www.youtube.com/watch?v=5x4Q_SOLN28&t=300s",
        "tags": ["project management", "polish", "tutorials" ],
        "blurb": "Seven common game design mistakes, including: thinking too big, ignoring onboarding tutorials, being too committed to an idea, igoring polish, and including random things.",
        "icon": "video"
    },
    {
        "title": "Downwell's Dual Purpose Design",
        "url": "https://www.youtube.com/watch?v=i5C1Uj7jJCg",
        "tags": [ "theory", "game analysis", "Downwell" ],
        "blurb": "All game elements in Downwell serve two or more purposes, which creates emergent gameplay and difficult choices for the player. Weapons also refill health, enemies provide a temporary speed reduction, and replaying levels allows you to master the controls.",
        "icon": "video"
    },
    {
        "title": "How to Get Your Game to Done",
        "url": "https://www.deengames.com/blog/2018/how-to-get-your-game-to-done.html",
        "tags": [ "project management", "prototyping" ],
        "blurb": "Many games don't make it to completion. An analysis of some common reasons games fail, and some ways to give your games a better chance at finishing. Analyze risks, prototype to find the fun, cut scope, and test thoroughly."
    },
    {
        "title": "Game Design in Open-World",
        "url": "https://www.deengames.com/blog/2018/game-design-in-open-world.html",
        "tags": [ "open world", "RPG", "JRPG", "CRPG" ],
        "blurb": "Open world games are difficult to design because you don't know where the player will go. Two solutions to the player-power vs. world-power difficulty: scale monster levels, or scale the player characters' levels."
    },
    {
        "title": "The Brilliance of Bastion's Flexible Builds",
        "url": "https://www.deengames.com/blog/2018/the-brilliance-of-bastions-flexible-builds.html",
        "tags": [ "balance", "game analysis", "Bastion" ],
        "blurb": "Bastion allows player flexibility and experimentation with different builds, by allowing you to pick your choice of weapon and character upgrades, and swap them at any time between levels."
    },
    {
        "title": "What is 'Souls-Like'?",
        "url": "https://critpoints.net/2020/03/11/what-is-souls-like/",
        "tags": [ "souls-like" ],
        "blurb": "A list of several key characteristics that make a game 'souls-like' as well as others that are often used but not key, ranging from currency lost on death but recoverable to dodge, block, and unexpected single-player PVP."
    },
    {
        "title": "What makes a Souls-like (and why the definition is important)",
        "url": "https://metro.co.uk/2020/08/29/what-makes-souls-like-why-definition-important-dark-souls-13193303/",
        "tags": [ "souls-like", "game analysis", "Demon's Souls", "Nioh" ],
        "blurb": "An opinion on six of the key defining characteristics of souls-like games, and how a few souls-like games implement them: the bonfire (reset and refill health), souls currency, stamina, shortcuts, and health item refills."
    },
    {
        "title": "Mitigating complexity and toxicity: A look at League of Legends",
        "url": "https://www.reddit.com/r/gamedesign/comments/kpwtkn/mitigating_complexity_and_toxicity_a_look_at/",
        "tags": [ "MOBA", "game analysis", "community" ],
        "blurb": "A look at Leage of Legends and how to reduce community toxicity in it, and in MOBAs in general, by changing the game design. Add opportunities to learn rules, make rules self-describing, speed up game, reduce the impact of a single bad player, and more."
    },
    {
        "title": "Scroll Back: The Theory and Practice of Cameras in Side-Scrollers",
        "url": "https://www.gamasutra.com/blogs/ItayKeren/20150511/243083/Scroll_Back_The_Theory_and_Practice_of_Cameras_in_SideScrollers.php",
        "tags": [ "camera", "visuals", "reference" ],
        "blurb": "A thorough reference of several different styles of cameras in 2D games, and how they work. Covers scrolling, attention, smoothing, snapping, framing, multi-focus, camera shake, and more."
    },
    {
        "title": "How To Balance An RPG",
        "url": "https://kotaku.com/how-to-balance-an-rpg-1625516832",
        "tags": ["single-player", "RPG", "JRPG", "balance", "classes"],
        "blurb": "Why and how to design your single-player RPG character classes so that they're mechanically interesting. You want players to make interesting choices through trade-offs. Make big differences, play-test, and use spreadsheets to balance."
    },
    {
        "title": "Game NPC Design - Why We Relate to A Pile of Code and Pixels",
        "url": "https://www.gamersnexus.net/gg/776-game-npc-design-npc-relatability",
        "tags": ["RPG", "JRPG", "character design", "NPCs"],
        "blurb": "Adding a bit of detail to your NPCs such as a backstory or personality quirks, can make them appear more life-like and interesting instead of generic place-holders."
    },
    {
        "title": "Numbers Getting Bigger: The Design and Math of Incremental Games",
        "url": "https://gamedevelopment.tutsplus.com/articles/numbers-getting-bigger-the-design-and-math-of-incremental-games--cms-24023",
        "tags": ["idle", "incremental"],
        "blurb": "An in-depth look at the design of idle and incremental games, including: discovery, multiple sources, exponential cost, offline play, plater optimization, and prestige."
    },
    {
        "title": "The Roguelike Lessons that Horror Design Needs to Learn",
        "url": "https://game-wisdom.com/critical/roguelike-lessons-horror",
        "tags": ["roguelike", "horror"],
        "blurb": "Some lessons horror games can learn from roguelikes, about pacing the game not too short or long, controlled use of random to avoid repetition, and adding in fighting; and a look at micro-horror."
    },
    {
        "title": "A Good Puzzle Game Is Hard To Build",
        "url": "https://www.rockpapershotgun.com/2015/01/22/how-to-make-a-puzzle-game/",
        "tags": ["puzzle"],
        "blurb": "Six tips on how to build a good puzzle game, including: helping the player along, learning over solving, exploring level designs, keeping the design streamlined and minimalism, and the role of a central game mechanic that everything contributes to."
    },
    {
        "title": "Game Design Perspective: Stardew Valley",
        "url": "https://www.pixelatedplaygrounds.com/sidequests/game-design-perspective-stardew-valley",
        "tags": ["game analysis", "Stardew Valley"],
        "blurb": "A look at what makes Stardew Valley such a well-designed game: variety (both small-scale variation and large-scale mechanics), activities overlap giving the player multiple choices, and delayed rewards."
    },
    {
        "title": "The Design of Mario Odyssey's Cascade Kingdom",
        "url": "https://www.youtube.com/watch?v=VxELCfmpr7E",
        "tags": [ "game analysis", "Super Mario Odyssey" ],
        "blurb": "Super Mario Odyssey is fun from the get-go, by following three principles: multiple options to overcome any obstacle, clear objectives for the player, and increasing the difficulty of a mechanic step by step as the level progresses.",
        "icon": "video"
    },
    {
        "title": "Top 7 Idle Game Mechanics",
        "url": "https://mobilefreetoplay.com/top-7-idle-game-mechanics/",
        "tags": ["idle", "incremental", "game analysis"],
        "blurb": "A brief look at seven sub-genres of idle games, and some of the game design pros and cons of each sub-genre: Linear clickers, arcade idles, merge games, management games, simulations, RPGs, and story-driven idle games."
    },
    {
        "title": "How do I come up with the game mechanics for a puzzle game?",
        "url": "https://gamedev.stackexchange.com/questions/47774/how-do-i-come-up-with-the-game-mechanics-for-a-puzzle-game",
        "tags": ["mechanics", "ideas", "puzzle"],
        "blurb": "How to come up with ame mechanics ideas? Play games, start with something small, copy things that work from others. Experiment, and iterate on your idea until it's great."
    },
    {
        "title": "Balancing Turn-Based RPGs: The Big Picture",
        "url": "https://gamedevelopment.tutsplus.com/articles/balancing-turn-based-rpgs-the-big-picture--gamedev-8286",
        "tags": ["RPG", "JRPG", "balance", "project management"],
        "blurb": "How to balance a JRPG from a high-level: knowing your audience, adjusting difficulty to achieve the intended game time, taking into acount progression, and balancing difficulty."
    },
    {
        "title": "The Psychological Trick That Can Make Rewards Backfire",
        "url": "https://www.youtube.com/watch?v=1ypOUn6rThM",
        "tags": ["behaviour", "player psychology", "theory"],
        "blurb": "Achievements and designer-made quests are extrinsic rewards, which can backfire and demotivate exploration and experimentation, which are intrinsic rewards. Leaderboards and personal bests work as self-motivating instric rewards.",
        "icon": "video"
    },
    {
        "title": "What is a Broughlike?",
        "url": "https://itch.io/jam/broughlike",
        "tags": ["broughlike"],
        "blurb": "A concise description of common game design elements in broughlikes: highly-compressed roguelikes on small boards with streamlined controls, procedural generation, binary resources, four-way movement, and more."
    },
    {
        "title": "The Reset Problem: A Case for Single-player Matchmaking",
        "url": "https://www.gamasutra.com/blogs/FabianFischer/20181030/326624/The_Reset_Problem_A_Case_for_Singleplayer_Matchmaking.php",
        "tags": [ "single-player", "roguelike", "action", "platformer", "difficulty", "dynamic difficulty" ],
        "blurb": "In single-player games, players die, restart, and often have to grind through boring/easy content. Players don't get to practice long at their highest skill level. There are some game-design solutions to that: dynamic difficulty, and single-player matchmaking."
    },
    {
        "title": "How to balance an RPG: or, how to not make your game feel completely broken",
        "url": "https://twitter.com/tanyaxshort/status/1301990872645468160",
        "tags": ["balance", "RPG", "JRPG", "formulas"],
        "blurb": "A concise Twitter thread explaining how to balance any arbitrary system in your game, such as damage, starting with the user experience and big-picture goals, all the way down to fine-tuning your final formulas."
    },
    {
        "title": "Why it is Better to Over-Nerf than Under-Nerf",
        "url": "https://askghostcrawler.tumblr.com/post/168521106958/this-may-go-back-to-your-time-at-blizzard-but-its",
        "tags": [ "balance", "MOBA" ],
        "blurb": "Over-nerfing in MOBAs solves the problem immediately and gives immediate feedback on the results. Under-nerfing leaves the problem running for a long time and doesn't give immediate feedback."
    },
    {
        "title": "Designing an RPG Inventory System That Fits: Preliminary Steps",
        "url": "https://gamedevelopment.tutsplus.com/articles/designing-an-rpg-inventory-system-that-fits-preliminary-steps--gamedev-14725",
        "tags": ["RPG", "JRPG", "MMO", "inventory"],
        "blurb": "A guide to designing your game's inventory sytsem so that it fits the target game experience and setting, starting with a look at four popular inventory systems (including JRPG, unlimited items, and grid-based systes), and then a process to design your own suitable inventory."
    },
    {
        "title": "Roguelike Level Design Addendum: Static or Procedural?",
        "url": "https://www.gridsagegames.com/blog/2019/03/roguelike-level-design-addendum-static-procedural/",
        "tags": ["roguelike", "procedural generation", "level design"],
        "blurb": "A brief discussion about the pros of static vs. procedural maps in roguelikes. Both have pros and cons, there's a spectrum in the middle, and roguelikes can benefit from a mix of different types."
    },
    {
        "title": "RPG Design: Do You Wanna Have Skillz or Have Some Class?",
        "url": "http://rampantgames.com/blog/?p=3720",
        "tags": ["RPG", "CRPG", "roguelike", "classes"],
        "blurb": "A brief definition of and look at games that use classes with fixed skills, free selection of skills, and hybrid options, with some of the pros and cons of each approach ."
    },
    {
        "title": "RPG Design: Staying Classy",
        "url": "http://rampantgames.com/blog/?p=3723",
        "tags": ["RPG", "CRPG", "classes"],
        "blurb": "A detailed look at the trade-offs - pros and cons - of class-based systems vs. skill-based systems. Simplicity for new players, restricting or balancing content, power fantasy, imbalance and unviable builds, and more."
    },
    {
        "title": "Game Design using Micro Macro Meta Grouping",
        "url": "https://levimoore.dev/game-design-using-micro-macro-meta-grouping/",
        "tags": ["theory", "core loop", "meta", "game analysis"],
        "blurb": "How to analyze the micro, macro, and meta groups of your game; what they look like when done really well; and an analysis of a few games (Candy Crush, League of Legends, Minecraft, Overcooked) using micro, macro, and meta."
    },
    {
        "title": "Number Punchers: How Final Fantasy and Dragon Quest handle combat math",
        "url": "https://www.gamasutra.com/view/news/325537/Number_Punchers_How_Final_Fantasy_and_Dragon_Quest_handle_combat_math.php",
        "tags": ["RPG", "CRPG", "JRPG", "formulas", "dragons quest", "final fantasy"],
        "blurb": "A look at how Final Fantasy and Dragon's Quest calculate damage, and how that affects everything from keeping monsters in play to character growth. Includes some useful questions to ask yourself when developing your own formulas."
    },
    {
        "title": "Match Game Mechanics: An exhaustive survey",
        "url": "https://www.gamasutra.com/blogs/JonathanBailey/20150227/237544/Match_Game_Mechanics_An_exhaustive_survey.php",
        "tags": ["match-3", "reference", "mechanics"],
        "blurb": "A thorough analysis of all the fundamentally different types of mechanics in Match-3 games: topology (grid shape and size), player actions, match conditions, gravity, block spawning, and auto-match."
    },
    {
        "title": "The Future of Match 3 – What You Need to Know – PART I",
        "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-i/",
        "tags": ["match-3", "monetization", "mobile", "IAP"],
        "blurb": "A look at single-dimensional match-3 games (with one core mechanic) vs. multi-dimensional meta games, the trade-offs for players, and some common game design elements that often characterize successful games"
    },
    {
        "title": "The Future of Match 3 – What You Need to Know – PART II",
        "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-ii/",
        "tags": ["match-3", "monetization", "mobile", "IAP"],
        "blurb": "An analysis of single-dimensional match-3 games, and three tips to make excellent ones, based on data: provide lots of things to play with, supply new mechanics over time, and lower the barrier for in-app purchases (IAP)"
    },
    {
        "title": "The Future of Match 3 – What You Need to Know – PART III",
        "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-iii/",
        "tags": ["match-3", "mobile", "monetization"],
        "blurb": "A look at the delicate balance of multi-dimensional meta match-3 games: every game element must balance the core layers. Find what parts of those two genres work together, add non-linearity, unique mechanics, dynamic items to buy, and rich social aspects, like ladders."
    },
    {
        "title": "How to crack the Match 3 code - Part 1",
        "url": "https://www.uxreviewer.com/home/2020/5/9/how-to-crack-the-match-3-code-part-1",
        "tags": ["match-3", "mobile", "core loop", "cross-game analysis"],
        "blurb": "Analysis of what makes Match 3 games so successful - simplified core loop, low player effort, short sessions - and how players now expect collapse-type mechanics, meta mechanics, in-game currency, and story in their match-3 games."
    },
    {
        "title": "How to Crack the Match 3 Code?- Part 2",
        "url": "https://www.gamerefinery.com/how-to-crack-the-match-3-code-part-2/",
        "tags": ["match-3", "mobile", "cross-game analysis", "consumables"],
        "blurb": "An in-depth analysis at what makes Candy Crush Saga and other meta match-3 games successful. Topics covered include currencies, boosters, rarity, collapse vs. swiping, IP, demographics, narration, and meta systems."
    }
]