[ { "title": "12 ways to improve turn-based RPG combat systems", "url": "https://sinisterdesign.net/12-ways-to-improve-turn-based-rpg-combat-systems/", "tags": [ "JRPG", "battle", "tactics" ], "blurb": "A list of twelve ways to change-up your RPG combat system, including using area, multiple characters, options, facing, and specialized monsters and characters. Focuses on emergent complexity, clarity, determinism, and tactics." }, { "title": "How to make a modern game that feels like a classic JRPG", "url": "https://gamecrate.com/how-make-modern-game-feels-classic-jrpg/14295", "tags": [ "JRPG", "battle" ], "blurb": "A look at what made classic 16-bit JRPGs so great, and how to implement those in your own RPG: stories are the key, Combat should be puzzle-like, battles should be breakable, side-quests should be clear and compelling. Unique stories is not a requirement." }, { "title": "Why are character-classes used in game design?", "url": "https://gamedev.stackexchange.com/questions/83251/why-are-character-classes-used-in-game-design", "tags": [ "RPG", "JRPG", "roguelike", "MOBA", "balance", "classes" ], "blurb": "Benefits of adding classes instead of using a class-less system in your game. They make it easier to balance, they help new players, they can provide class-specific quests or story plot points, and more." }, { "title": "How to Start Designing Games", "url": "https://medium.com/super-jump/how-to-start-designing-games-f4cb5440ebf9", "tags": [ "theory", "mechanics", "prototyping", "aesthetics", "core loop", "goals" ], "blurb": "A thorough introduction to the fundamentals of game design, and how to implement them in your game. Aesthetics, mechanics, economy, narrative story, mechanics, goals, prototypes, and how to connect them all together." }, { "title": "How To Perfect Your Game’s Core Loop", "url": "https://gameanalytics.com/blog/how-to-perfect-your-games-core-loop/", "tags": [ "core loop", "goals" ,"polish" ], "blurb": "How to design the core game loop and surrounding game loops to focus on the fun in your game. A clear goal, short loop, and strong theme go a long way. Prototype, iterate, and keep improving." }, { "title": "The 13 Basic Principles of Gameplay Design", "url": "https://www.gamedeveloper.com/design/the-13-basic-principles-of-gameplay-design", "tags": [ "theory" ], "blurb": "13 fundamental principles of game design, with system, level, and UI design examples. Player role, communication, appeal, spacing, pacing, sound, physics, overlapping events, anticipation, believable behaviour, and more." }, { "title": "How to Make an RPG: Levels", "url": "http://howtomakeanrpg.com/a/how-to-make-an-rpg-levels.html", "tags": [ "JRPG", "RPG", "project management", "formulas" ], "blurb": "Levels in RPGs instil a sense of achievement, dripfeed mechanics to the player, and control content flow. Analyzes formulas from Dungeons and Dragons, Pokemon, Disgea, and provides tips on writing your own formulas." }, { "title": "Getting Started in Automated Game Design", "url": "https://www.youtube.com/watch?v=dZv-vRrnHDA", "tags": [ "procedural generation", "automated game design", "generative space" ], "blurb": "A detailed introduction to automated game design: writing code that designs game mechanics for you. Start with three landmark games, look at the search space size, and use automated game-playing to tell how strategic or fun the game is.", "type": "video" }, { "title": "Are Lives Outdated Game Design?", "url": "https://www.youtube.com/watch?v=c2CLO8CcBjg", "tags": ["lives", "checkpoints", "side-scroller", "platformer"], "blurb": "Older games use lives or checkpoints, which cause frustration when replaying the same content over and over, but it's useful for procedural games. Powering up after death can reduce boredom. What other methods can replace lives?", "type": "video" }, { "title": "7 Game Design Mistakes to Avoid", "url": "https://www.youtube.com/watch?v=5x4Q_SOLN28&t=300s", "tags": ["project management", "polish", "tutorials" ], "blurb": "Seven common game design mistakes, including: thinking too big, ignoring onboarding tutorials, being too committed to an idea, igoring polish, and including random things.", "type": "video" }, { "title": "Downwell's Dual Purpose Design", "url": "https://www.youtube.com/watch?v=i5C1Uj7jJCg", "tags": [ "theory", "game analysis", "Downwell", "emergent gameplay"], "blurb": "All game elements in Downwell serve two or more purposes, which creates emergent gameplay and difficult choices for the player. Weapons also refill health, enemies provide a temporary speed reduction, and replaying levels allows you to master the controls.", "type": "video" }, { "title": "How to Get Your Game to Done", "url": "https://www.deengames.com/blog/2018/how-to-get-your-game-to-done.html", "tags": [ "project management", "prototyping" ], "blurb": "Many games don't make it to completion. An analysis of some common reasons games fail, and some ways to give your games a better chance at finishing. Analyze risks, prototype to find the fun, cut scope, and test thoroughly." }, { "title": "Game Design in Open-World", "url": "https://www.deengames.com/blog/2018/game-design-in-open-world.html", "tags": [ "open world", "RPG", "JRPG", "CRPG" ], "blurb": "Open world games are difficult to design because you don't know where the player will go. Two solutions to the player-power vs. world-power difficulty: scale monster levels, or scale the player characters' levels." }, { "title": "The Brilliance of Bastion's Flexible Builds", "url": "https://www.deengames.com/blog/2018/the-brilliance-of-bastions-flexible-builds.html", "tags": [ "balance", "game analysis", "Bastion" ], "blurb": "Bastion allows player flexibility and experimentation with different builds, by allowing you to pick your choice of weapon and character upgrades, and swap them at any time between levels." }, { "title": "What is 'Souls-Like'?", "url": "https://critpoints.net/2020/03/11/what-is-souls-like/", "tags": [ "souls-like" ], "blurb": "A list of several key characteristics that make a game 'souls-like' as well as others that are often used but not key, ranging from currency lost on death but recoverable to dodge, block, and unexpected single-player PVP." }, { "title": "What makes a Souls-like (and why the definition is important)", "url": "https://metro.co.uk/2020/08/29/what-makes-souls-like-why-definition-important-dark-souls-13193303/", "tags": [ "souls-like", "game analysis", "Demon's Souls", "Nioh" ], "blurb": "An opinion on six of the key defining characteristics of souls-like games, and how a few souls-like games implement them: the bonfire (reset and refill health), souls currency, stamina, shortcuts, and health item refills." }, { "title": "Mitigating complexity and toxicity: A look at League of Legends", "url": "https://www.reddit.com/r/gamedesign/comments/kpwtkn/mitigating_complexity_and_toxicity_a_look_at/", "tags": [ "MOBA", "game analysis", "community" ], "blurb": "A look at Leage of Legends and how to reduce community toxicity in it, and in MOBAs in general, by changing the game design. Add opportunities to learn rules, make rules self-describing, speed up game, reduce the impact of a single bad player, and more." }, { "title": "Scroll Back: The Theory and Practice of Cameras in Side-Scrollers", "url": "https://www.gamedeveloper.com/design/scroll-back-the-theory-and-practice-of-cameras-in-side-scrollers", "tags": [ "camera", "visuals", "reference" ], "blurb": "A thorough reference of several different styles of cameras in 2D games, and how they work. Covers scrolling, attention, smoothing, snapping, framing, multi-focus, camera shake, and more." }, { "title": "How To Balance An RPG", "url": "https://kotaku.com/how-to-balance-an-rpg-1625516832", "tags": ["single-player", "RPG", "JRPG", "balance", "classes"], "blurb": "Why and how to design your single-player RPG character classes so that they're mechanically interesting. You want players to make interesting choices through trade-offs. Make big differences, play-test, and use spreadsheets to balance." }, { "title": "Game NPC Design - Why We Relate to A Pile of Code and Pixels", "url": "https://www.gamersnexus.net/gg/776-game-npc-design-npc-relatability", "tags": ["RPG", "JRPG", "character design", "NPCs"], "blurb": "Adding a bit of detail to your NPCs such as a backstory or personality quirks, can make them appear more life-like and interesting instead of generic place-holders." }, { "title": "Numbers Getting Bigger: The Design and Math of Incremental Games", "url": "https://gamedevelopment.tutsplus.com/articles/numbers-getting-bigger-the-design-and-math-of-incremental-games--cms-24023", "tags": ["idle", "incremental"], "blurb": "An in-depth look at the design of idle and incremental games, including: discovery, multiple sources, exponential cost, offline play, plater optimization, and prestige." }, { "title": "The Roguelike Lessons that Horror Design Needs to Learn", "url": "https://game-wisdom.com/critical/roguelike-lessons-horror", "tags": ["roguelike", "horror"], "blurb": "Some lessons horror games can learn from roguelikes, about pacing the game not too short or long, controlled use of random to avoid repetition, and adding in fighting; and a look at micro-horror." }, { "title": "A Good Puzzle Game Is Hard To Build", "url": "https://www.rockpapershotgun.com/2015/01/22/how-to-make-a-puzzle-game/", "tags": ["puzzle"], "blurb": "Six tips on how to build a good puzzle game, including: helping the player along, learning over solving, exploring level designs, keeping the design streamlined and minimalism, and the role of a central game mechanic that everything contributes to." }, { "title": "Game Design Perspective: Stardew Valley", "url": "https://www.pixelatedplaygrounds.com/sidequests/game-design-perspective-stardew-valley", "tags": ["game analysis", "Stardew Valley"], "blurb": "A look at what makes Stardew Valley such a well-designed game: variety (both small-scale variation and large-scale mechanics), activities overlap giving the player multiple choices, and delayed rewards." }, { "title": "The Design of Mario Odyssey's Cascade Kingdom", "url": "https://www.youtube.com/watch?v=VxELCfmpr7E", "tags": [ "game analysis", "Super Mario Odyssey" ], "blurb": "Super Mario Odyssey is fun from the get-go, by following three principles: multiple options to overcome any obstacle, clear objectives for the player, and increasing the difficulty of a mechanic step by step as the level progresses.", "type": "video" }, { "title": "Top 7 Idle Game Mechanics", "url": "https://mobilefreetoplay.com/top-7-idle-game-mechanics/", "tags": ["idle", "incremental", "game analysis"], "blurb": "A brief look at seven sub-genres of idle games, and some of the game design pros and cons of each sub-genre: Linear clickers, arcade idles, merge games, management games, simulations, RPGs, and story-driven idle games." }, { "title": "How do I come up with the game mechanics for a puzzle game?", "url": "https://gamedev.stackexchange.com/questions/47774/how-do-i-come-up-with-the-game-mechanics-for-a-puzzle-game", "tags": ["mechanics", "ideas", "puzzle"], "blurb": "How to come up with ame mechanics ideas? Play games, start with something small, copy things that work from others. Experiment, and iterate on your idea until it's great." }, { "title": "Balancing Turn-Based RPGs: The Big Picture", "url": "https://gamedevelopment.tutsplus.com/articles/balancing-turn-based-rpgs-the-big-picture--gamedev-8286", "tags": ["RPG", "JRPG", "balance", "project management"], "blurb": "How to balance a JRPG from a high-level: knowing your audience, adjusting difficulty to achieve the intended game time, taking into acount progression, and balancing difficulty." }, { "title": "The Psychological Trick That Can Make Rewards Backfire", "url": "https://www.youtube.com/watch?v=1ypOUn6rThM", "tags": ["behaviour", "player psychology", "theory"], "blurb": "Achievements and designer-made quests are extrinsic rewards, which can backfire and demotivate exploration and experimentation, which are intrinsic rewards. Leaderboards and personal bests work as self-motivating instric rewards.", "type": "video" }, { "title": "What is a Broughlike?", "url": "https://itch.io/jam/broughlike", "tags": ["broughlike"], "blurb": "A concise description of common game design elements in broughlikes: highly-compressed roguelikes on small boards with streamlined controls, procedural generation, binary resources, four-way movement, and more." }, { "title": "The Reset Problem: A Case for Single-player Matchmaking", "url": "https://www.gamedeveloper.com/design/the-reset-problem-a-case-for-single-player-matchmaking", "tags": [ "single-player", "dynamic difficulty", "balance", "matchmaking", "roguelike" ], "blurb": "In single-player games, players die, restart, and often have to grind through boring/easy content. Players don't get to practice long at their highest skill level. There are some game-design solutions to that: dynamic difficulty, and single-player matchmaking. Specific advice about roguelikes <a href='https://twitter.com/Ludokultur/status/1419706641893707788'>here</a> and <a href='https://twitter.com/Ludokultur/status/1419724219554926593'>here</a>." }, { "title": "How to balance an RPG: or, how to not make your game feel completely broken", "url": "https://twitter.com/tanyaxshort/status/1301990872645468160", "tags": ["balance", "RPG", "JRPG", "formulas"], "blurb": "A concise Twitter thread explaining how to balance any arbitrary system in your game, such as damage, starting with the user experience and big-picture goals, all the way down to fine-tuning your final formulas." }, { "title": "Why it is Better to Over-Nerf than Under-Nerf", "url": "https://askghostcrawler.tumblr.com/post/168521106958/this-may-go-back-to-your-time-at-blizzard-but-its", "tags": [ "balance", "MOBA" ], "blurb": "Over-nerfing in MOBAs solves the problem immediately and gives immediate feedback on the results. Under-nerfing leaves the problem running for a long time and doesn't give immediate feedback." }, { "title": "Designing an RPG Inventory System That Fits: Preliminary Steps", "url": "https://gamedevelopment.tutsplus.com/articles/designing-an-rpg-inventory-system-that-fits-preliminary-steps--gamedev-14725", "tags": ["RPG", "JRPG", "MMO", "inventory"], "blurb": "A guide to designing your game's inventory sytsem so that it fits the target game experience and setting, starting with a look at four popular inventory systems (including JRPG, unlimited items, and grid-based systes), and then a process to design your own suitable inventory." }, { "title": "Roguelike Level Design Addendum: Static or Procedural?", "url": "https://www.gridsagegames.com/blog/2019/03/roguelike-level-design-addendum-static-procedural/", "tags": ["roguelike", "procedural generation", "level design"], "blurb": "A brief discussion about the pros of static vs. procedural maps in roguelikes. Both have pros and cons, there's a spectrum in the middle, and roguelikes can benefit from a mix of different types." }, { "title": "RPG Design: Do You Wanna Have Skillz or Have Some Class?", "url": "http://rampantgames.com/blog/?p=3720", "tags": ["RPG", "CRPG", "roguelike", "classes"], "blurb": "A brief definition of and look at games that use classes with fixed skills, free selection of skills, and hybrid options, with some of the pros and cons of each approach ." }, { "title": "RPG Design: Staying Classy", "url": "http://rampantgames.com/blog/?p=3723", "tags": ["RPG", "CRPG", "classes"], "blurb": "A detailed look at the trade-offs - pros and cons - of class-based systems vs. skill-based systems. Simplicity for new players, restricting or balancing content, power fantasy, imbalance and unviable builds, and more." }, { "title": "Game Design using Micro Macro Meta Grouping", "url": "https://levimoore.dev/game-design-using-micro-macro-meta-grouping/", "tags": ["theory", "core loop", "meta", "game analysis"], "blurb": "How to analyze the micro, macro, and meta groups of your game; what they look like when done really well; and an analysis of a few games (Candy Crush, League of Legends, Minecraft, Overcooked) using micro, macro, and meta." }, { "title": "Number Punchers: How Final Fantasy and Dragon Quest handle combat math", "url": "https://www.gamedeveloper.com/design/number-punchers-how-i-final-fantasy-i-and-i-dragon-quest-i-handle-combat-math", "tags": ["RPG", "CRPG", "JRPG", "formulas", "Dragons Quest", "final fantasy"], "blurb": "A look at how Final Fantasy and Dragon's Quest calculate damage, and how that affects everything from keeping monsters in play to character growth. Includes some useful questions to ask yourself when developing your own formulas." }, { "title": "Match Game Mechanics: An exhaustive survey", "url": "https://www.gamedeveloper.com/design/match-game-mechanics-an-exhaustive-survey", "tags": ["match-3", "reference", "mechanics"], "blurb": "A thorough analysis of all the fundamentally different types of mechanics in Match-3 games: topology (grid shape and size), player actions, match conditions, gravity, block spawning, and auto-match." }, { "title": "The Future of Match 3 – What You Need to Know – PART I", "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-i/", "tags": ["match-3", "monetization", "mobile", "IAP"], "blurb": "A look at single-dimensional match-3 games (with one core mechanic) vs. multi-dimensional meta games, the trade-offs for players, and some common game design elements that often characterize successful games" }, { "title": "The Future of Match 3 – What You Need to Know – PART II", "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-ii/", "tags": ["match-3", "monetization", "mobile", "IAP"], "blurb": "An analysis of single-dimensional match-3 games, and three tips to make excellent ones, based on data: provide lots of things to play with, supply new mechanics over time, and lower the barrier for in-app purchases (IAP)" }, { "title": "The Future of Match 3 – What You Need to Know – PART III", "url": "https://www.gamerefinery.com/the-future-of-match-3-what-you-need-to-know-part-iii/", "tags": ["match-3", "mobile", "monetization"], "blurb": "A look at the delicate balance of multi-dimensional meta match-3 games: every game element must balance the core layers. Find what parts of those two genres work together, add non-linearity, unique mechanics, dynamic items to buy, and rich social aspects, like ladders." }, { "title": "How to crack the Match 3 code - Part 1", "url": "https://www.uxreviewer.com/home/2020/5/9/how-to-crack-the-match-3-code-part-1", "tags": ["match-3", "mobile", "core loop", "cross-game analysis"], "blurb": "Analysis of what makes Match 3 games so successful - simplified core loop, low player effort, short sessions - and how players now expect collapse-type mechanics, meta mechanics, in-game currency, and story in their match-3 games." }, { "title": "How to Crack the Match 3 Code?- Part 2", "url": "https://www.gamerefinery.com/how-to-crack-the-match-3-code-part-2/", "tags": ["match-3", "mobile", "cross-game analysis", "consumables"], "blurb": "An in-depth analysis at what makes Candy Crush Saga and other meta match-3 games successful. Topics covered include currencies, boosters, rarity, collapse vs. swiping, IP, demographics, narration, and meta systems." }, { "title": "How to Design a Game Around Emergent Gameplay", "url": "https://medium.com/@GWBycer/how-to-design-a-game-around-emergent-gameplay-a9348557570b", "tags": ["emergent gameplay", "depth", "complexity", "mechanics", "goals"], "blurb": "A look at what emergent gameplay is and isn't, and some ingredients that support emergent gameplay: mechanics with multiple purposes, properties, goals, multiple solutions. It isn't just an open world or a moddable game." }, { "title": "Complexity and Emergent Gameplay", "url": "https://www.gamesprecipice.com/complexity-emergent-gameplay/", "tags": ["emergent gameplay", "depth", "complexity", "mechanics", "scoring", "cross-game analysis"], "blurb": "Complexity, depth, and the ratio between them determines emergent gameplay. A look at some board games that create depth out of simple mechanics, and how rules, scoring, and social elements can increase depth without increasing complexity. (Looks at board games, but directly applicable to video games.)" }, { "title": "Emergent Complexity in Games", "url": "https://sites.psu.edu/gamedesignbynickdemarco/2014/02/13/emergent-complexity-in-games/", "tags": ["emergent gameplay", "complexity", "economy", "Scribblenauts", "Pokemon"], "blurb": "Emergent gameplay is the holy grail of game design. Game designers can implement intentional emergence (e.g. Scribblenauts) and unintentional emergence (e.g. Pokemon cloning glitch), which can break your game." }, { "title": "Tutorial: Generative & Possibility Space", "url": "https://www.possibilityspace.org/tutorial-generative-possibility-space/", "tags": ["generative space", "procedural generation", "platformer"], "blurb": "An introduction to possibility and generative spaces, and a look at generating Mario levels: some algorithms generate in larger, more varied but also unplayable spaces, while others generate smaller, more interesting, but more predictable spaces." }, { "title": "Perlin Noise, Procedural Content Generation, and Interesting Space", "url": "https://heredragonsabound.blogspot.com/2019/02/perlin-noise-procedural-content.html", "tags": ["procedural generation", "generative space", "roguelike"], "blurb": "Random generation can generate many spaces, but few are interesting spaces. You can make your generation hit more interesting spaces by leveraging deep domain knowledge about your game world to make interesting content. Interesting spaces are oddly-shaped and probably use various different algorithms." }, { "title": "Procedurally Assisted Generation", "url": "http://david.fancyfishgames.com/2016/08/procedurally-assisted-generation.html", "tags": ["procedural generation", "generative space"], "blurb": "Procedural generation is great at adding variation on content, but not creating new content (other than AI). Hand-crafted levels add content - bosses, enemies, and core progression. Create an intelligent design by using PCG to generate layouts and fill spaces; this reduces development time while maintaining that hand-crafted feel." }, { "title": "Guide to all the different Anti-Grind Mechanics that JRPG developers have made over the years", "url": "https://www.reddit.com/r/JRPG/comments/m5u2we/guide_to_all_the_different_antigrind_mechanics/", "tags": ["JRPG", "balance", "dynamic difficulty", "cross-game analysis"], "blurb": "Many JRPGs created interesting designs that don't require or allow players to grind, such as scaling enemies, reducing or eliminating XP, level caps, not respawning monsters, and penalizing the player; this thread lists pros and cons, too." }, { "title": "Vagrant Story and its lessons for uninspired JRPG game design", "url": "https://www.gamedeveloper.com/design/vagrant-story-and-its-lessons-for-uninspired-jrpg-game-design", "tags": ["JRPG", "Vagrant Story"], "blurb": "Many JRPGs, old and new, reuse mechanics out of tradition or nostalgia, despite them being poor game design (e.g. random encounters). We can innovate and make more fun games: include customization, remove unnecessary towns and areas, make unique areas, reward exploration, making battles meaningful, etc." }, { "title": "Skill-based bonus levels in Royal Match (Match-3)", "url": "https://twitter.com/emojipopcast/status/1379890929897598976", "tags": ["match-3", "Royal Match", "game analysis", "difficulty"], "blurb": "A short Twitter thread analyzing how Royal Match maintains a casual difficulty while providing high-skill bonus levels for expert players to try, every ten levels. These are optional, high-risk, high-reward levels." }, { "title": "Royal Match - The New King from Turkey?", "url": "https://www.deconstructoroffun.com/blog/2021/3/21/royal-match-the-new-king-from-turkey", "tags": ["match-3", "game analysis", "Royal Match", "mobile"], "blurb": "An in-depth look at Royal Match, how it fits into the match-3 puzzle mobile industry, and how it recombines, innovates, and removes elements from other games to create something which a much better user experience for players." }, { "title": "How to Design Levels With the Super Mario World Method", "url": "https://gamedevelopment.tutsplus.com/articles/how-to-design-levels-with-the-super-mario-world-method--cms-25177", "tags": ["level design", "difficulty", "balance", "Super Mario World", "CCST"], "blurb": "An introduction to the challenge, cadence, skill-theme system Nintendo uses in Mario and other games. You design challenges, evolve them into qualitatively different types, expand them into quantitatively bigger challenges, and ultimately combine these tools together to craft interesting, balanced challenges for players." }, { "title": "The Super Mario World Method: Using Evolutions and Expansions", "url": "https://gamedevelopment.tutsplus.com/articles/the-super-mario-world-method-using-evolutions-and-expansions--cms-25295", "tags": ["Super Mario World", "CCST", "level design"], "blurb": "An in-depth look at challenges and expansions in level design; how you can evolve different types of challenges; how difficulty is subjective, not numerical; and practical examples of how to construct a level with different challenges that evolve into a final cululative challenge." }, { "title": "The Super Mario World Method: Understanding Skill Themes", "url": "https://gamedevelopment.tutsplus.com/articles/the-super-mario-world-method-understanding-skill-themes--cms-25722", "tags": ["Super Mario World", "CCST", "level design", "skills"], "blurb": "An analysis of the skill-sets in Super Mario World, which is a composite of an action and platformer game. Levels focus on one genre - platformer vs. action - and on one skill theme - precision vs. speed. You can use these ideas to create genre-focused levels that shift between skill-sets within a level." }, { "title": "Making Levels With the Super Mario World Method: Skill Themes, Part 2", "url": "https://gamedevelopment.tutsplus.com/articles/making-levels-with-the-super-mario-world-method-skill-themes-part-2--cms-26110", "tags": ["Super Mario World", "CCST", "level design", "skills", "inversions", "difficulty"], "blurb": "A look at momentum and inercepts in Super Mario World, and level design tool: inversions, such as having a power-up will block a player. Mixing these with intercepts creates different scenarios that require different levels of skill to pass." }, { "title": "What's the Point of Critical Hits? ~ Design Doc", "url": "https://www.youtube.com/watch?v=fMFkd7edBR0", "tags": ["critical-hits", "mechanics", "balance"], "blurb": "Critical hits are deceptively simple: add more damage randomly. You can change both aspects (when to crit, and what to crit) to create unique mechanics, such as extra status effects, skill-based critical hits or even negative critical hits. Critical hits work well in some genres (RPGs, first-person shooters), but can frustrate in others (fighting or tactical games).", "type": "video" }, { "title": "How to Keep Players Engaged (Without Being Evil)", "url": "https://www.youtube.com/watch?v=hbzGO_Qonu0", "tags": ["engagement", "pacing", "intensity", "difficulty", "core loop", "goals"], "blurb": "How to keep players engaged, without addictive evil design? Pacing (varying the intensity) of the pillars (core gameplay) such as alternating puzzles with action or cutscenes; anticipation and foreshadowing (what's behind that giant door?), mysteries (including narrative), long-term goals like collectables or map completion, and compelling challenge (not too easy or difficult)", "type": "video" }, { "title": "Steambirds: Survival Mobile", "url": "https://lostgarden.home.blog/2011/10/13/steambirds-survival-mobile/", "tags": ["arrow of play", "game analysis", "choice", "pacing", "goals"], "blurb": "An introduction to the concept of arrow of play, the property of systems that always move the player forward (such as hunger in roguelikes). Several examples from Steambirds about arrow of play: decay, increasing enemies, short-term and long-term goals, currency and currency flow, and limited choices." }, { "title": "Oil it or Spoil it!", "url": "https://www.fortressofdoors.com/oil-it-or-spoil-it/", "tags": ["game analysis", "final fantasy", "Dragons Quest", "x-com"], "blurb": "We often talk about game juice as cascading actions in response to user input, but what about oil? 'Oiling' a game to remove user pain can drastically improve it. Examples from Dragons Quest, Final Fantasty I, and X-COM illustrate pain-points and their solutions." }, { "title": "The Legend of Zelda: A Link to the Past's dungeon design", "url": "https://www.youtube.com/watch?v=ouO1R6vFDBo", "tags": ["game analysis", "Link to the Past", "level design", "linearity", "open world"], "blurb": "Link to the Past uses a combination of linear dungeons, open dungeons, and hybrid dungeons. Linear dungeons build tension and direction, hybrid ones allow some exploration, and open dungeons allow you to explore and solve them in any or short orders if you know what you're doing. Many dungeons loop back, giving the feeling of being bigger than they are, and one uses 3D space.", "type": "video" }, { "title": "Directing Exploration - How Games Guide Players WITHOUT Tutorials", "url": "https://www.youtube.com/watch?v=rrL3iG_uacw", "tags": ["game analysis", "linearity", "open world"], "blurb": "Break games down into three categories: linear, semi-linear, and open-world. Each guides the player subtly or directly, using visual cues or forcing back-tracking. An analysis of Mario Brothers, Metroid, and Legend of Zelda (NES originals) shows how Nintendo masters this in the first few seconds of each of these games.", "type": "video" }, { "title": "Game Designer Critiques The Legend Of Zelda: A Link To The Past", "url": "https://www.youtube.com/watch?v=-MC8QQaV1zI", "tags": ["game analysis", "Link to the Past", "level design", "ARPG", "core loop"], "blurb": "The first half of this video looks at A Link to the Past's game design: the core pillars of exploration, combat, and puzzles intersect heavily. Each item works for multiple core pillars; the core loop is explore, fight, puzzle, and get an item; it teases secrets you can't reach; unlocking items minimizes places to backtrack; and the game is based around interaction with the world, not necessarily the core gameplay.", "type": "video" }, { "title": "How Games Use Feedback Loops", "url": "https://www.youtube.com/watch?v=H4kbJObhcHw", "tags": ["game analysis", "Call of Duty", "Mario Kart", "Pyre"], "blurb": "Games contain both positive feedback loops (winners win more, losers lose more) and negative loops (winners get disadvantaged, losers get advantaged). Positive loops accelerate the game but may alienate low-skill players, while negative loops give weaker players a winning chance but may frustrate stronger players. Plus, some tips to minimize the drawbacks.", "type": "video" }, { "title": "Side Quests - How To Make A Good Detour", "url": "https://www.youtube.com/watch?v=yTJ_RjfhGVQ", "tags": ["side quests", "game analysis", "cross-game analysis", "Yakuza", "Bug Fables", "Paper Mario", "Mass Effect", "Cross Code"], "blurb": "How can you make amazing side quests? With a few ingredients: start by making it easy to accept and track side-quests. Side quests can advance and supplement story, provide a variety of gameplay in mini-games, require different elaborate usage of game systems, or provide extreme difficulty with a super-boss or secret dungeon. Rewards should be appropriate and worth the effort, they can keep players ahead or keep them from falling behind.", "type": "video" }, { "title": "Final Fantasy Evolutions: Blue Mage Job Class (Final Fantasy V - Final Fantasy XIV)", "url": "https://www.youtube.com/watch?v=Mvg7ta05BGk", "tags": ["Final Fantasy", "Final Fantasy Evolutions", "cross-game analysis", "JRPG"], "blurb": "Final Fantasy 5 introduced the Blue Mage class. How did the design of this class change through to Final Fantasy 14? From aesthetics to mechanics. Blue magic is sometimes character or materia specific, and often shared with class members. Characters either need to win the battle, see the spell, or be hit by it. Often it's a utility class, and sometimes a special move; and sometimes, it erodes your soul.", "type": "video" }, { "title": "The Complete Evolution of Ultimate Weapons", "url": "https://www.youtube.com/watch?v=6P56OH7RQy8", "tags": ["Final Fantasy", "Final Fantasy Evolutions", "JRPG", "cross-game analysis"], "blurb": "A quick look at how ultimate weapons changed, starting with Final Fantasy 1 and up to Final Fantasy 15. Common themes, including trade-offs: ultimate vs. second-tier best, ultimate per character vs. ultimate per class type or category, ultimates with special effects, and ultimates that require powering up to reach their full potential.", "type": "video" }, { "title": "Shovel Knight and Nailing Nostalgia", "url": "https://www.youtube.com/watch?v=rHhX5GtWNr8", "tags": ["game analysis", "Shovel Knight", "nostalgia", "8-bit", "aesthetics"], "blurb": "Shovel Knight nails nostalgia with four main techniques: copying from multiple sources (not just one game), emulating what works well from those games, modernising what doesn't work (e.g. checkpoints instead of lives), and rose-tinting - such as smooth controls, wide screen, difficulty options, and other modern trimmings.", "type": "video" }, { "title": "The Rise of the Systemic Game", "url": "https://www.youtube.com/watch?v=SnpAAX9CkIc", "tags": ["emergent gameplay", "systemic design"], "blurb": "Systemic design is when game systems can impact each other signicantly, which often leads to emergent gameplay. You can achieve this by: allowing things to be aware of and interact with other things (e.g. NPCs and animals interact); designing consistent, universal rules (e.g. wood can catch fire); and giving the user a goal, along with an open-ended way to achieve it (don't constrain the solution). Examples from Breath of the Wild, Far Cry, GTA, Dues Ex, and more.", "type": "video" }, { "title": "How Games Do Health", "url": "https://www.youtube.com/watch?v=4AEKbBF3URE", "tags": ["health", "first-person shooters", "Doom 2016", "Call of Duty", "Dark Souls"], "blurb": "Games use different health systems, including: discrete health generated by health packs; regenerating health, which makes games more intense; persistent health, which makes every encounter important; hybrid systems; Yoshi's Island, where the game changes entirely when you get hurt; and others. There are many interesting systems and possibilities.", "type": "video" }, { "title": "Good Game Design - Bosses", "url": "https://www.youtube.com/watch?v=YmwLPF11eos", "tags": ["bosses"], "blurb": "Good boss battles are fun, challenging, intimidating, unique. They sometimes give awesome rewards, introduce new mechanics, or use multiple phases (to keep things fresh). They should have a purpose - why am I fighting this boss? Avoid padding bosses with health, or giving unavoidable or overly difficult challenges.", "type": "video" }, { "title": "Boss Battle Design ~ Design Doc", "url": "https://www.youtube.com/watch?v=wUPugc51udc", "tags": ["bosses", "Arkham Asylum", "Metal Gear Solid", "Star Fox Adventures"], "blurb": "Three ways to make a great boss include a test of skill, a narrative device, or a mechanical change-of-pace. You can see good, and bad, examples of this, in Batman: Arkham Asylum, Metal Gear Solid 3, an Star Fox Adventures", "type": "video" }, { "title": "How to Design the Best Boss Battles: 4 Must-Read Tips", "url": "https://www.nyfa.edu/student-resources/how-to-design-best-boss-battles-4-must-read-tips/", "tags": ["bosses"], "blurb": "Great bosses often include four things: a memorable build-up before the match, different mechanics that prepare the player for future challenges, story and world enrichment, and testing certain skills." }, { "title": "How to Design Great Metroidvania Levels | Game Design", "url": "https://www.youtube.com/watch?v=bAHXYfP38CA", "tags": ["level design", "metroidvania"], "blurb": "You can use a few simple techniques to design a great metroidvania: draft the map as a bunch of connected rooms; develop the timeline of key events, bosses, and locations; plan player abilities and how they fit into the world; make individual rooms; test, test, test, modify, and test again.", "type": "video" }, { "title": "What Makes a Good RPG Town?", "url": "https://www.youtube.com/watch?v=uXleufh2mY0", "tags": ["towns", "RPG", "JRPG", "cross-game analysis"], "blurb": "What makes a great town? A check-point and safe space between danger; a health/resource refiller (if battles are about resource depletion); a break from intense combat with things like secrets, lore, or mini-games; a place to complete quests for rewards; hints about future dangers or optional quests; a source of environmental storytelling", "type": "video" }, { "title": "Building Better Crafting Systems", "url": "https://www.youtube.com/watch?v=Nj7EaryBgak", "tags": ["crafting", "cross-game analysis"], "blurb": "An in-depth look at the three components of crafting systems: collection, crafting, and usage - and how to make them shine; mistakes to avoid that make crafting laborious; how to make simple crafting meaningful; and when your game should and include crafting: to give players control over the way they play, and an organic way to interact with the mechanics.", "type": "video" }, { "title": "How Do You Improve Turn Based Combat?", "url": "https://www.youtube.com/watch?v=ktogjiX3eI4", "blurb": "Turn-based combat is often slow and grindy. How can you improve it? Speed up actions, intros, and attack animations; use quick-time events so attacking and defending are interactive; streamline menu navigation; integrate turn economy (add, cancel, speed up, and slow down turns); reward players with new moves, interesting tactical choices, and story bits between battles; make interesting, unique monsters; use fights sparingly; grant small rewards like skill-points.", "tags": ["turn-based combat", "RPG", "JRPG", "Disgaea", "Persona 5", "Paper Mario", "Pokemon", "Super Mario RPG", "Dragons Quest", "Fire Emblem", "cross-game analysis"], "type": "video" }, { "title": "Are Score Systems Still Relevant?", "url": "https://www.youtube.com/watch?v=K6y9PJipfpk", "blurb": "High scores originated in arcade games, but can provide modern games with additional benefits. Achieving a high score can be like an additional difficulty level if it requires more skillful play; it can turn the game into a very different, second game; and it can incentivize personal performance within levels. But, take care to avoid the downside of demoralizing players by slapping them with a poor ranking.", "tags": ["scoring", "Tony Hawk Pro Skater", "Assault Android Cactus", "Opus Magnum"], "type": "video" }, { "title": "How Do Save Systems Shape Games?", "url": "https://www.youtube.com/watch?v=rzk5CESZMDQ", "blurb": "Save systems broadly fall into two categories: save anywhere, and desginated save points. Save anywhere reduces the tension or drama of losing progress from dying, which most games can work with. It encourages more risk-taking and experimentation, because the risk is low. It can also enable save-scumming: with randomized games, players can reload repeatedly to get the game to give players what they want. Designed save points often provide safe havens or telegraph boss fights. Bigger gaps between save points raise the stakes. Auto-saves work well, but can potentially soft-lock (players can't progress further because of the state), or in a state where players can't win if you continue. Keeping recent backup files avoids this problem.", "tags": ["saving", "Shovel Knight", "Resident Evil", "Fire Emblem"], "type": "video" }, { "title": "What Makes A Game Speedrun Friendly?", "url": "https://www.youtube.com/watch?v=ixmOKhM_AlI", "blurb": "You can make your game more speed-running with some (mostly small) changes: make all cutscenes skippable; make tutorials skippable for players who know how to play; minimize time to retry a level (players will retry a lot); allow user-set retry points; and remove randomness as much as possible.", "tags": ["speedrunning", "Neon White", "Stuntman"], "type": "video" } ]